let data = {
    "Sheet1": [
        {
            "รหัสจากโรงงาน": "101-10-0101",
            "ชื่อสินค้า": "750-16 X-MULTI HD Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0101",
            "ชื่อสินค้า": "750-16 X-MULTI HD Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0101",
            "ชื่อสินค้า": "750-16 X-MULTI HD Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0101",
            "ชื่อสินค้า": "750-16 X-MULTI HD Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0201",
            "ชื่อสินค้า": "215/70 R17.5 X-INCITY Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0201",
            "ชื่อสินค้า": "215/70 R17.5 X-INCITY Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0201",
            "ชื่อสินค้า": "215/70 R17.5 X-INCITY Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0601",
            "ชื่อสินค้า": "825 R16 AGILIS"
        },
        {
            "รหัสจากโรงงาน": "101-10-0601",
            "ชื่อสินค้า": "825 R16 AGILIS"
        },
        {
            "รหัสจากโรงงาน": "101-10-0601",
            "ชื่อสินค้า": "825 R16 AGILIS"
        },
        {
            "รหัสจากโรงงาน": "101-10-0603",
            "ชื่อสินค้า": "700 R16 AGILIS"
        },
        {
            "รหัสจากโรงงาน": "101-10-0603",
            "ชื่อสินค้า": "700 R16 AGILIS"
        },
        {
            "รหัสจากโรงงาน": "101-10-0603",
            "ชื่อสินค้า": "700 R16 AGILIS"
        },
        {
            "รหัสจากโรงงาน": "101-10-0603",
            "ชื่อสินค้า": "700 R16 AGILIS"
        },
        {
            "รหัสจากโรงงาน": "101-10-0802",
            "ชื่อสินค้า": "215/75 R17.5 X MULTI-Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0802",
            "ชื่อสินค้า": "215/75 R17.5 X MULTI-Z"
        },
        {
            "รหัสจากโรงงาน": "101-10-0901",
            "ชื่อสินค้า": "9.5 R17.5 X MULTI-Z+"
        },
        {
            "รหัสจากโรงงาน": "101-10-0901",
            "ชื่อสินค้า": "9.5 R17.5 X MULTI-Z+"
        },
        {
            "รหัสจากโรงงาน": "101-10-0901",
            "ชื่อสินค้า": "9.5 R17.5 X MULTI-Z+"
        },
        {
            "รหัสจากโรงงาน": "101-10-0901",
            "ชื่อสินค้า": "9.5 R17.5 X MULTI-Z+"
        },
        {
            "รหัสจากโรงงาน": "101-11-0701",
            "ชื่อสินค้า": "11 R22.5 X MULTI-Z 2"
        },
        {
            "รหัสจากโรงงาน": "101-11-0701",
            "ชื่อสินค้า": "11 R22.5 X MULTI-Z 2"
        },
        {
            "รหัสจากโรงงาน": "101-11-0702",
            "ชื่อสินค้า": "295/80 R22.5 X MULTI-Z 2"
        },
        {
            "รหัสจากโรงงาน": "101-11-0702",
            "ชื่อสินค้า": "295/80 R22.5 X MULTI-Z 2"
        },
        {
            "รหัสจากโรงงาน": "101-11-1504",
            "ชื่อสินค้า": "11 R 22.5 XZY-3"
        },
        {
            "รหัสจากโรงงาน": "101-11-1504",
            "ชื่อสินค้า": "11 R 22.5 XZY-3"
        },
        {
            "รหัสจากโรงงาน": "101-11-1702",
            "ชื่อสินค้า": "1000 R 20 XDY-3"
        },
        {
            "รหัสจากโรงงาน": "101-11-1801",
            "ชื่อสินค้า": "295/80 R22.5 XDA2+"
        },
        {
            "รหัสจากโรงงาน": "101-11-1902",
            "ชื่อสินค้า": "1000 R20 XZA-2"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "101-11-2501",
            "ชื่อสินค้า": "295/80 R22.5 X-COACH"
        },
        {
            "รหัสจากโรงงาน": "102-10-0201",
            "ชื่อสินค้า": "205/85 R16 XJE4"
        },
        {
            "รหัสจากโรงงาน": "102-10-0201",
            "ชื่อสินค้า": "205/85 R16 XJE4"
        },
        {
            "รหัสจากโรงงาน": "102-11-0201",
            "ชื่อสินค้า": "1000 R20  XM-71"
        },
        {
            "รหัสจากโรงงาน": "102-97-0001",
            "ชื่อสินค้า": "ยางโอริง ML 3-25 SULLA R1437"
        },
        {
            "รหัสจากโรงงาน": "102-97-0002",
            "ชื่อสินค้า": "ยางโอริง ML 2-25 HEUPO R1438"
        },
        {
            "รหัสจากโรงงาน": "102-98-0005",
            "ชื่อสินค้า": "ยางใน ML 20 N VALVE TR78A (1000-20)"
        },
        {
            "รหัสจากโรงงาน": "102-98-0007",
            "ชื่อสินค้า": "ยางใน ML 20 P VALVE TR78A (1100-20)"
        },
        {
            "รหัสจากโรงงาน": "102-99-0001",
            "ชื่อสินค้า": "ยางรอง ML 20X7.50"
        },
        {
            "รหัสจากโรงงาน": "102-99-0002",
            "ชื่อสินค้า": "ยางรอง ML 20X8.50"
        },
        {
            "รหัสจากโรงงาน": "102-99-0005",
            "ชื่อสินค้า": "ยางรอง ML 16L MI"
        },
        {
            "รหัสจากโรงงาน": "103-10-0501",
            "ชื่อสินค้า": "ยางนอก S 750 R16/14 HW"
        },
        {
            "รหัสจากโรงงาน": "103-22-0302",
            "ชื่อสินค้า": "ยางนอก S 13.6-38/6 ไถนา"
        },
        {
            "รหัสจากโรงงาน": "103-22-0302",
            "ชื่อสินค้า": "ยางนอก S 13.6-38/6 ไถนา"
        },
        {
            "รหัสจากโรงงาน": "103-22-0302",
            "ชื่อสินค้า": "ยางนอก S 13.6-38/6 ไถนา"
        },
        {
            "รหัสจากโรงงาน": "103-98-0014",
            "ชื่อสินค้า": "ยางใน S 7.50-16 TR 177"
        },
        {
            "รหัสจากโรงงาน": "103-98-0023",
            "ชื่อสินค้า": "ยางใน S 10.00-20 TR 78"
        },
        {
            "รหัสจากโรงงาน": "104-10-0102",
            "ชื่อสินค้า": "BFG 750 R16 CROSS CONTROL"
        },
        {
            "รหัสจากโรงงาน": "104-10-0204",
            "ชื่อสินค้า": "BFG 215/75 R17.5 ROUTE CONTROL RC"
        },
        {
            "รหัสจากโรงงาน": "104-11-0102",
            "ชื่อสินค้า": "BFG 1100 R20 CROSS CONTROL"
        },
        {
            "รหัสจากโรงงาน": "104-11-0103",
            "ชื่อสินค้า": "BFG 11 R22.5 CROSS CONTROL"
        },
        {
            "รหัสจากโรงงาน": "104-11-0201",
            "ชื่อสินค้า": "BFG 1000 R20 ROUTE CONTROL RC"
        },
        {
            "รหัสจากโรงงาน": "104-11-0202",
            "ชื่อสินค้า": "BFG 11 R22.5 ROUTE CONTROL RC"
        },
        {
            "รหัสจากโรงงาน": "104-11-0202",
            "ชื่อสินค้า": "BFG 11 R22.5 ROUTE CONTROL RC"
        },
        {
            "รหัสจากโรงงาน": "104-11-0402",
            "ชื่อสินค้า": "BFG 11 R22.5 ROUTE CONTROL RC/S2"
        },
        {
            "รหัสจากโรงงาน": "104-11-0404",
            "ชื่อสินค้า": "BFG 295/80 R22.5 ROUTE CONTROL RC/S2"
        },
        {
            "รหัสจากโรงงาน": "106-01-1312",
            "ชื่อสินค้า": "185/55 R15  NCT-5"
        },
        {
            "รหัสจากโรงงาน": "106-01-1313",
            "ชื่อสินค้า": "205/55 R16  NCT-5"
        },
        {
            "รหัสจากโรงงาน": "106-01-2305",
            "ชื่อสินค้า": "185/55 R16 Excellence"
        },
        {
            "รหัสจากโรงงาน": "106-01-2305",
            "ชื่อสินค้า": "185/55 R16 Excellence"
        },
        {
            "รหัสจากโรงงาน": "106-01-2305",
            "ชื่อสินค้า": "185/55 R16 Excellence"
        },
        {
            "รหัสจากโรงงาน": "106-01-2305",
            "ชื่อสินค้า": "185/55 R16 Excellence"
        },
        {
            "รหัสจากโรงงาน": "106-04-0201",
            "ชื่อสินค้า": "235/65 R17 Efficient Grip Performance"
        },
        {
            "รหัสจากโรงงาน": "106-04-0301",
            "ชื่อสินค้า": "225/70 R15 Wrangler Silenttrac"
        },
        {
            "รหัสจากโรงงาน": "106-04-0502",
            "ชื่อสินค้า": "265/50 R20 Efficient Grip SUV"
        },
        {
            "รหัสจากโรงงาน": "106-04-0502",
            "ชื่อสินค้า": "265/50 R20 Efficient Grip SUV"
        },
        {
            "รหัสจากโรงงาน": "106-04-1213",
            "ชื่อสินค้า": "215/50 R17 Efficient Grip"
        },
        {
            "รหัสจากโรงงาน": "106-10-0105",
            "ชื่อสินค้า": "Good Year 750-15/12 G-11"
        },
        {
            "รหัสจากโรงงาน": "106-20-0101",
            "ชื่อสินค้า": "Good Year 700-15/8 CXCG"
        },
        {
            "รหัสจากโรงงาน": "106-20-0101",
            "ชื่อสินค้า": "Good Year 700-15/8 CXCG"
        },
        {
            "รหัสจากโรงงาน": "106-20-0102",
            "ชื่อสินค้า": "Good Year 750-16/8 CXCG"
        },
        {
            "รหัสจากโรงงาน": "106-20-0102",
            "ชื่อสินค้า": "Good Year 750-16/8 CXCG"
        },
        {
            "รหัสจากโรงงาน": "106-98-0008",
            "ชื่อสินค้า": "ยางใน GY 750-16"
        },
        {
            "รหัสจากโรงงาน": "106-98-0014",
            "ชื่อสินค้า": "ยางใน GY 1100-20"
        },
        {
            "รหัสจากโรงงาน": "106-99-0004",
            "ชื่อสินค้า": "ยางรอง GY 650/700-750/825-16"
        },
        {
            "รหัสจากโรงงาน": "109-10-0101",
            "ชื่อสินค้า": "Firestone 750-15/12  T-192"
        },
        {
            "รหัสจากโรงงาน": "109-10-0103",
            "ชื่อสินค้า": "Firestone 825-16/12  T-192"
        },
        {
            "รหัสจากโรงงาน": "109-10-0104",
            "ชื่อสินค้า": "Firestone 825-16/14  T-192"
        },
        {
            "รหัสจากโรงงาน": "109-10-0105",
            "ชื่อสินค้า": "Firestone 750-16/12 T-192"
        },
        {
            "รหัสจากโรงงาน": "109-10-0204",
            "ชื่อสินค้า": "Firestone 600-14/8  T-191"
        },
        {
            "รหัสจากโรงงาน": "109-10-0205",
            "ชื่อสินค้า": "Firestone 650-14/8  T-191"
        },
        {
            "รหัสจากโรงงาน": "109-10-0301",
            "ชื่อสินค้า": "Firestone 9.5 R17.5 F-595"
        },
        {
            "รหัสจากโรงงาน": "109-11-0402",
            "ชื่อสินค้า": "Firestone 900-20/14 L-542"
        },
        {
            "รหัสจากโรงงาน": "109-11-0402",
            "ชื่อสินค้า": "Firestone 900-20/14 L-542"
        },
        {
            "รหัสจากโรงงาน": "109-11-0404",
            "ชื่อสินค้า": "Firestone 1000-20/16 L-542"
        },
        {
            "รหัสจากโรงงาน": "109-11-0404",
            "ชื่อสินค้า": "Firestone 1000-20/16 L-542"
        },
        {
            "รหัสจากโรงงาน": "109-11-0404",
            "ชื่อสินค้า": "Firestone 1000-20/16 L-542"
        },
        {
            "รหัสจากโรงงาน": "109-11-0404",
            "ชื่อสินค้า": "Firestone 1000-20/16 L-542"
        },
        {
            "รหัสจากโรงงาน": "109-11-0501",
            "ชื่อสินค้า": "Firestone 900-20/14  F-495"
        },
        {
            "รหัสจากโรงงาน": "109-11-0501",
            "ชื่อสินค้า": "Firestone 900-20/14  F-495"
        },
        {
            "รหัสจากโรงงาน": "109-11-0503",
            "ชื่อสินค้า": "Firestone 1000-20/16  F-495"
        },
        {
            "รหัสจากโรงงาน": "109-11-0503",
            "ชื่อสินค้า": "Firestone 1000-20/16  F-495"
        },
        {
            "รหัสจากโรงงาน": "109-11-0503",
            "ชื่อสินค้า": "Firestone 1000-20/16  F-495"
        },
        {
            "รหัสจากโรงงาน": "109-11-0503",
            "ชื่อสินค้า": "Firestone 1000-20/16  F-495"
        },
        {
            "รหัสจากโรงงาน": "109-11-0602",
            "ชื่อสินค้า": "Firestone 1000 R20/16  F-595"
        },
        {
            "รหัสจากโรงงาน": "109-11-0602",
            "ชื่อสินค้า": "Firestone 1000 R20/16  F-595"
        },
        {
            "รหัสจากโรงงาน": "109-11-0602",
            "ชื่อสินค้า": "Firestone 1000 R20/16  F-595"
        },
        {
            "รหัสจากโรงงาน": "109-11-0701",
            "ชื่อสินค้า": "Firestone 11 R22.5 T-559"
        },
        {
            "รหัสจากโรงงาน": "109-11-0801",
            "ชื่อสินค้า": "Firestone 11 R22.5 FS-555"
        },
        {
            "รหัสจากโรงงาน": "109-11-1001",
            "ชื่อสินค้า": "Firestone 295/80 R22.5 FS401"
        },
        {
            "รหัสจากโรงงาน": "111-01-0101",
            "ชื่อสินค้า": "SIAMES 195/55 R15 XT420"
        },
        {
            "รหัสจากโรงงาน": "111-01-0101",
            "ชื่อสินค้า": "SIAMES 195/55 R15 XT420"
        },
        {
            "รหัสจากโรงงาน": "111-01-0201",
            "ชื่อสินค้า": "SIAMES 225/55 R17 RS01"
        },
        {
            "รหัสจากโรงงาน": "111-01-0201",
            "ชื่อสินค้า": "SIAMES 225/55 R17 RS01"
        },
        {
            "รหัสจากโรงงาน": "111-01-0201",
            "ชื่อสินค้า": "SIAMES 225/55 R17 RS01"
        },
        {
            "รหัสจากโรงงาน": "111-04-0101",
            "ชื่อสินค้า": "SIAMES 265/60 R18 XT420"
        },
        {
            "รหัสจากโรงงาน": "111-04-0101",
            "ชื่อสินค้า": "SIAMES 265/60 R18 XT420"
        },
        {
            "รหัสจากโรงงาน": "111-04-0102",
            "ชื่อสินค้า": "SIAMES 265/50 R20 XT420"
        },
        {
            "รหัสจากโรงงาน": "112-02-0101",
            "ชื่อสินค้า": "SUPERSTONE 205/70 R15 TITAN"
        },
        {
            "รหัสจากโรงงาน": "112-02-0101",
            "ชื่อสินค้า": "SUPERSTONE 205/70 R15 TITAN"
        },
        {
            "รหัสจากโรงงาน": "112-02-0101",
            "ชื่อสินค้า": "SUPERSTONE 205/70 R15 TITAN"
        },
        {
            "รหัสจากโรงงาน": "112-02-0102",
            "ชื่อสินค้า": "SUPERSTONE 215/70 R15 TITAN"
        },
        {
            "รหัสจากโรงงาน": "112-10-0102",
            "ชื่อสินค้า": "SUPERSTONE 155-10/6 TUK(SR55)"
        },
        {
            "รหัสจากโรงงาน": "112-10-0102",
            "ชื่อสินค้า": "SUPERSTONE 155-10/6 TUK(SR55)"
        },
        {
            "รหัสจากโรงงาน": "112-10-0107",
            "ชื่อสินค้า": "SUPERSTONE 600-14/8 LT"
        },
        {
            "รหัสจากโรงงาน": "112-10-0107",
            "ชื่อสินค้า": "SUPERSTONE 600-14/8 LT"
        },
        {
            "รหัสจากโรงงาน": "112-10-0107",
            "ชื่อสินค้า": "SUPERSTONE 600-14/8 LT"
        },
        {
            "รหัสจากโรงงาน": "112-10-0107",
            "ชื่อสินค้า": "SUPERSTONE 600-14/8 LT"
        },
        {
            "รหัสจากโรงงาน": "112-10-0111",
            "ชื่อสินค้า": "SUPERSTONE 700-15/12 LT"
        },
        {
            "รหัสจากโรงงาน": "112-10-0201",
            "ชื่อสินค้า": "SUPERSTONE 700-15/12 UL"
        },
        {
            "รหัสจากโรงงาน": "112-10-0201",
            "ชื่อสินค้า": "SUPERSTONE 700-15/12 UL"
        },
        {
            "รหัสจากโรงงาน": "112-10-0202",
            "ชื่อสินค้า": "SUPERSTONE 750-15/14 UL"
        },
        {
            "รหัสจากโรงงาน": "112-10-0203",
            "ชื่อสินค้า": "SUPERSTONE 700-16/12 UL"
        },
        {
            "รหัสจากโรงงาน": "112-10-0204",
            "ชื่อสินค้า": "SUPERSTONE 750-16/14 UL"
        },
        {
            "รหัสจากโรงงาน": "112-10-0205",
            "ชื่อสินค้า": "SUPERSTONE 650-14/8 UL"
        },
        {
            "รหัสจากโรงงาน": "112-10-0208",
            "ชื่อสินค้า": "SUPERSTONE 825-16/16 UL"
        },
        {
            "รหัสจากโรงงาน": "112-20-0102",
            "ชื่อสินค้า": "SUPERSTONE 750-16/8  OFF ROAD M/T(ก)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0101",
            "ชื่อสินค้า": "SUPERSTONE 600-14/8 ไถนา-หลัง"
        },
        {
            "รหัสจากโรงงาน": "112-22-0104",
            "ชื่อสินค้า": "SUPERSTONE 750-16/8 ไถนา-หลัง(ST356)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0104",
            "ชื่อสินค้า": "SUPERSTONE 750-16/8 ไถนา-หลัง(ST356)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0105",
            "ชื่อสินค้า": "SUPERSTONE 650-14/8 ไถนา-หลัง"
        },
        {
            "รหัสจากโรงงาน": "112-22-0105",
            "ชื่อสินค้า": "SUPERSTONE 650-14/8 ไถนา-หลัง"
        },
        {
            "รหัสจากโรงงาน": "112-22-0105",
            "ชื่อสินค้า": "SUPERSTONE 650-14/8 ไถนา-หลัง"
        },
        {
            "รหัสจากโรงงาน": "112-22-0105",
            "ชื่อสินค้า": "SUPERSTONE 650-14/8 ไถนา-หลัง"
        },
        {
            "รหัสจากโรงงาน": "112-22-0106",
            "ชื่อสินค้า": "SUPERSTONE 18.4/15-30/8 ไถนา-หลัง(SPT)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0106",
            "ชื่อสินค้า": "SUPERSTONE 18.4/15-30/8 ไถนา-หลัง(SPT)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0106",
            "ชื่อสินค้า": "SUPERSTONE 18.4/15-30/8 ไถนา-หลัง(SPT)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0106",
            "ชื่อสินค้า": "SUPERSTONE 18.4/15-30/8 ไถนา-หลัง(SPT)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0201",
            "ชื่อสินค้า": "SUPERSTONE 750-16/8 ไถนา(SF88)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0201",
            "ชื่อสินค้า": "SUPERSTONE 750-16/8 ไถนา(SF88)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0203",
            "ชื่อสินค้า": "SUPERSTONE 500-15/6 ไถนา-หน้า"
        },
        {
            "รหัสจากโรงงาน": "112-22-0204",
            "ชื่อสินค้า": "SUPERSTONE 750-18/8 ไถนา-หน้า"
        },
        {
            "รหัสจากโรงงาน": "112-22-0205",
            "ชื่อสินค้า": "SUPERSTONE 400-12/4 ไถนา-หน้า"
        },
        {
            "รหัสจากโรงงาน": "112-22-0301",
            "ชื่อสินค้า": "SUPERSTONE 9.5-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0301",
            "ชื่อสินค้า": "SUPERSTONE 9.5-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0301",
            "ชื่อสินค้า": "SUPERSTONE 9.5-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0302",
            "ชื่อสินค้า": "SUPERSTONE 8.3-22/6 ไถนา"
        },
        {
            "รหัสจากโรงงาน": "112-22-0303",
            "ชื่อสินค้า": "SUPERSTONE 11.2-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0303",
            "ชื่อสินค้า": "SUPERSTONE 11.2-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0303",
            "ชื่อสินค้า": "SUPERSTONE 11.2-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0303",
            "ชื่อสินค้า": "SUPERSTONE 11.2-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0304",
            "ชื่อสินค้า": "SUPERSTONE 12.4-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0306",
            "ชื่อสินค้า": "SUPERSTONE 900-16/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0306",
            "ชื่อสินค้า": "SUPERSTONE 900-16/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0307",
            "ชื่อสินค้า": "SUPERSTONE 14.9-24/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0308",
            "ชื่อสินค้า": "SUPERSTONE 750-15/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0308",
            "ชื่อสินค้า": "SUPERSTONE 750-15/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0308",
            "ชื่อสินค้า": "SUPERSTONE 750-15/8 ไถนา(ST357)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0401",
            "ชื่อสินค้า": "SUPERSTONE 7-16/6 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0401",
            "ชื่อสินค้า": "SUPERSTONE 7-16/6 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0402",
            "ชื่อสินค้า": "SUPERSTONE 8-18/8 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0402",
            "ชื่อสินค้า": "SUPERSTONE 8-18/8 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0402",
            "ชื่อสินค้า": "SUPERSTONE 8-18/8 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0402",
            "ชื่อสินค้า": "SUPERSTONE 8-18/8 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0402",
            "ชื่อสินค้า": "SUPERSTONE 8-18/8 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0403",
            "ชื่อสินค้า": "SUPERSTONE 8-16/6 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0403",
            "ชื่อสินค้า": "SUPERSTONE 8-16/6 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0403",
            "ชื่อสินค้า": "SUPERSTONE 8-16/6 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0403",
            "ชื่อสินค้า": "SUPERSTONE 8-16/6 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0403",
            "ชื่อสินค้า": "SUPERSTONE 8-16/6 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0406",
            "ชื่อสินค้า": "SUPERSTONE 500-12/4 ไถนา-หลัง(ST358)"
        },
        {
            "รหัสจากโรงงาน": "112-22-0502",
            "ชื่อสินค้า": "SUPERSTONE 13.6-26/8 ไถนา(ST359)"
        },
        {
            "รหัสจากโรงงาน": "112-98-0011",
            "ชื่อสินค้า": "ยางใน TY 14.9-24 TR218A"
        },
        {
            "รหัสจากโรงงาน": "113-10-0302",
            "ชื่อสินค้า": "Vee Rubber 650-14/8  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0303",
            "ชื่อสินค้า": "Vee Rubber 750-15/12  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0304",
            "ชื่อสินค้า": "Vee Rubber 700-15/12 หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0304",
            "ชื่อสินค้า": "Vee Rubber 700-15/12 หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0307",
            "ชื่อสินค้า": "Vee Rubber 750-16/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0308",
            "ชื่อสินค้า": "Vee Rubber 825-16/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0308",
            "ชื่อสินค้า": "Vee Rubber 825-16/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0308",
            "ชื่อสินค้า": "Vee Rubber 825-16/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0309",
            "ชื่อสินค้า": "Vee Rubber 700-16/12  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-10-0403",
            "ชื่อสินค้า": "Vee Rubber 825-16/14  หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-10-0403",
            "ชื่อสินค้า": "Vee Rubber 825-16/14  หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-10-0405",
            "ชื่อสินค้า": "Vee Rubber 700-16/12  หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-10-0406",
            "ชื่อสินค้า": "Vee Rubber 750-16/14  หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-10-0406",
            "ชื่อสินค้า": "Vee Rubber 750-16/14  หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-10-0407",
            "ชื่อสินค้า": "Vee Rubber 700-15/12 หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-10-0408",
            "ชื่อสินค้า": "Vee Rubber 750-15/12 หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-11-0102",
            "ชื่อสินค้า": "Vee Rubber 900-20/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-11-0102",
            "ชื่อสินค้า": "Vee Rubber 900-20/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-11-0102",
            "ชื่อสินค้า": "Vee Rubber 900-20/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-11-0103",
            "ชื่อสินค้า": "Vee Rubber 1000-20/16  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-11-0103",
            "ชื่อสินค้า": "Vee Rubber 1000-20/16  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-11-0106",
            "ชื่อสินค้า": "Vee Rubber 825-20/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-11-0106",
            "ชื่อสินค้า": "Vee Rubber 825-20/14  หน้า"
        },
        {
            "รหัสจากโรงงาน": "113-11-0201",
            "ชื่อสินค้า": "Vee Rubber 900-20/14  หลัง(หยาบ)"
        },
        {
            "รหัสจากโรงงาน": "113-11-0202",
            "ชื่อสินค้า": "Vee Rubber 1000-20/16  หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-11-0202",
            "ชื่อสินค้า": "Vee Rubber 1000-20/16  หลัง"
        },
        {
            "รหัสจากโรงงาน": "113-11-0206",
            "ชื่อสินค้า": "Vee Rubber 825-20/14  หลัง"
        },
        {
            "รหัสจากโรงงาน": "114-01-0507",
            "ชื่อสินค้า": "Deestone 195/70 R14 R R201"
        },
        {
            "รหัสจากโรงงาน": "114-01-0601",
            "ชื่อสินค้า": "Deestone 155/70 R12 R R202"
        },
        {
            "รหัสจากโรงงาน": "114-02-0101",
            "ชื่อสินค้า": "Deestone 195-14/8 R R401"
        },
        {
            "รหัสจากโรงงาน": "114-02-0101",
            "ชื่อสินค้า": "Deestone 195-14/8 R R401"
        },
        {
            "รหัสจากโรงงาน": "114-02-0302",
            "ชื่อสินค้า": "Deestone 215/70 R15 R R402"
        },
        {
            "รหัสจากโรงงาน": "114-10-0205",
            "ชื่อสินค้า": "Deestone 650-14/8  หน้า"
        },
        {
            "รหัสจากโรงงาน": "114-10-0207",
            "ชื่อสินค้า": "Deestone 700-15/12  หน้า"
        },
        {
            "รหัสจากโรงงาน": "114-10-0208",
            "ชื่อสินค้า": "Deestone 700-16/12  หน้า"
        },
        {
            "รหัสจากโรงงาน": "114-10-0208",
            "ชื่อสินค้า": "Deestone 700-16/12  หน้า"
        },
        {
            "รหัสจากโรงงาน": "114-10-1101",
            "ชื่อสินค้า": "Deestone 9.5 R17.5 SV-402"
        },
        {
            "รหัสจากโรงงาน": "114-10-1101",
            "ชื่อสินค้า": "Deestone 9.5 R17.5 SV-402"
        },
        {
            "รหัสจากโรงงาน": "114-10-1101",
            "ชื่อสินค้า": "Deestone 9.5 R17.5 SV-402"
        },
        {
            "รหัสจากโรงงาน": "114-10-1201",
            "ชื่อสินค้า": "Deestone 235/75 R17.5 SV-401"
        },
        {
            "รหัสจากโรงงาน": "114-11-0401",
            "ชื่อสินค้า": "Deestone 825-20/14 D-202 หลังลึก"
        },
        {
            "รหัสจากโรงงาน": "114-11-0401",
            "ชื่อสินค้า": "Deestone 825-20/14 D-202 หลังลึก"
        },
        {
            "รหัสจากโรงงาน": "114-11-1102",
            "ชื่อสินค้า": "Deestone 1000 R 20 SV-401"
        },
        {
            "รหัสจากโรงงาน": "114-11-1102",
            "ชื่อสินค้า": "Deestone 1000 R 20 SV-401"
        },
        {
            "รหัสจากโรงงาน": "114-22-0002",
            "ชื่อสินค้า": "Deestone 600-16/6  ไถนา"
        },
        {
            "รหัสจากโรงงาน": "114-22-0003",
            "ชื่อสินค้า": "Deestone 600-19/8  ไถนา"
        },
        {
            "รหัสจากโรงงาน": "114-22-0005",
            "ชื่อสินค้า": "Deestone 750-16/8  ไถหลัง"
        },
        {
            "รหัสจากโรงงาน": "114-23-0002",
            "ชื่อสินค้า": "Deestone 600-9/10  ET"
        },
        {
            "รหัสจากโรงงาน": "114-23-0002",
            "ชื่อสินค้า": "Deestone 600-9/10  ET"
        },
        {
            "รหัสจากโรงงาน": "114-23-0003",
            "ชื่อสินค้า": "Deestone 650-10/10 ET"
        },
        {
            "รหัสจากโรงงาน": "114-23-0004",
            "ชื่อสินค้า": "Deestone 700-12/12 ET"
        },
        {
            "รหัสจากโรงงาน": "114-23-0201",
            "ชื่อสินค้า": "Deestone 500-8 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-23-0202",
            "ชื่อสินค้า": "Deestone 600-9 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-23-0202",
            "ชื่อสินค้า": "Deestone 600-9 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-23-0202",
            "ชื่อสินค้า": "Deestone 600-9 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-23-0203",
            "ชื่อสินค้า": "Deestone 700-12 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-23-0203",
            "ชื่อสินค้า": "Deestone 700-12 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-23-0203",
            "ชื่อสินค้า": "Deestone 700-12 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-23-0204",
            "ชื่อสินค้า": "Deestone 650-10 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-23-0204",
            "ชื่อสินค้า": "Deestone 650-10 D-306 (ยางตัน)"
        },
        {
            "รหัสจากโรงงาน": "114-24-0101",
            "ชื่อสินค้า": "Deestone 900-20-14  ดอกเรียบ(DC327)"
        },
        {
            "รหัสจากโรงงาน": "114-24-0101",
            "ชื่อสินค้า": "Deestone 900-20-14  ดอกเรียบ(DC327)"
        },
        {
            "รหัสจากโรงงาน": "114-24-0101",
            "ชื่อสินค้า": "Deestone 900-20-14  ดอกเรียบ(DC327)"
        },
        {
            "รหัสจากโรงงาน": "114-24-0101",
            "ชื่อสินค้า": "Deestone 900-20-14  ดอกเรียบ(DC327)"
        },
        {
            "รหัสจากโรงงาน": "114-25-0102",
            "ชื่อสินค้า": "Deestone 1400-24/12 DG-2(D-310)"
        },
        {
            "รหัสจากโรงงาน": "114-25-0102",
            "ชื่อสินค้า": "Deestone 1400-24/12 DG-2(D-310)"
        },
        {
            "รหัสจากโรงงาน": "114-25-0207",
            "ชื่อสินค้า": "Deestone 23.5-25/20 D-313 TL"
        },
        {
            "รหัสจากโรงงาน": "114-25-0207",
            "ชื่อสินค้า": "Deestone 23.5-25/20 D-313 TL"
        },
        {
            "รหัสจากโรงงาน": "114-25-0208",
            "ชื่อสินค้า": "Deestone 17.5-25/16 D-313 TL"
        },
        {
            "รหัสจากโรงงาน": "114-25-0208",
            "ชื่อสินค้า": "Deestone 17.5-25/16 D-313 TL"
        },
        {
            "รหัสจากโรงงาน": "114-25-0208",
            "ชื่อสินค้า": "Deestone 17.5-25/16 D-313 TL"
        },
        {
            "รหัสจากโรงงาน": "114-25-0209",
            "ชื่อสินค้า": "Deestone 20.5-25/20 D-313 TL"
        },
        {
            "รหัสจากโรงงาน": "114-25-0502",
            "ชื่อสินค้า": "Deestone 23.1-26/12 D-320"
        },
        {
            "รหัสจากโรงงาน": "114-98-0001",
            "ชื่อสินค้า": "ยางใน DS 500-10"
        },
        {
            "รหัสจากโรงงาน": "114-98-0003",
            "ชื่อสินค้า": "ยางใน DS 600-9"
        },
        {
            "รหัสจากโรงงาน": "114-98-0004",
            "ชื่อสินค้า": "ยางใน DS 650-10"
        },
        {
            "รหัสจากโรงงาน": "114-98-0005",
            "ชื่อสินค้า": "ยางใน DS 700-12"
        },
        {
            "รหัสจากโรงงาน": "114-98-0007",
            "ชื่อสินค้า": "ยางใน DS 600/650-14"
        },
        {
            "รหัสจากโรงงาน": "114-98-0014",
            "ชื่อสินค้า": "ยางใน DS 900-20"
        },
        {
            "รหัสจากโรงงาน": "114-98-0021",
            "ชื่อสินค้า": "ยางใน DS 8-18 TR15"
        },
        {
            "รหัสจากโรงงาน": "114-98-0022",
            "ชื่อสินค้า": "ยางใน DS 13.6-26 TR218A"
        },
        {
            "รหัสจากโรงงาน": "114-98-0023",
            "ชื่อสินค้า": "ยางใน DS 11.2/12.4-24 TR218A"
        },
        {
            "รหัสจากโรงงาน": "114-98-0024",
            "ชื่อสินค้า": "ยางใน DS 9.5-24 TR218A"
        },
        {
            "รหัสจากโรงงาน": "114-98-0103",
            "ชื่อสินค้า": "ยางใน DS 1000 R 20"
        },
        {
            "รหัสจากโรงงาน": "114-99-0002",
            "ชื่อสินค้า": "ยางรอง DS 600-9"
        },
        {
            "รหัสจากโรงงาน": "114-99-0003",
            "ชื่อสินค้า": "ยางรอง DS 650-10"
        },
        {
            "รหัสจากโรงงาน": "114-99-0004",
            "ชื่อสินค้า": "ยางรอง DS 700-12"
        },
        {
            "รหัสจากโรงงาน": "114-99-0103",
            "ชื่อสินค้า": "ยางรอง DS 1000 R 20"
        },
        {
            "รหัสจากโรงงาน": "115-02-0906",
            "ชื่อสินค้า": "Bridgestone 195-15 R-611"
        },
        {
            "รหัสจากโรงงาน": "115-10-0105",
            "ชื่อสินค้า": "Bridgestone 700-15/10  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0107",
            "ชื่อสินค้า": "Bridgestone 750-15/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0107",
            "ชื่อสินค้า": "Bridgestone 750-15/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0107",
            "ชื่อสินค้า": "Bridgestone 750-15/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0107",
            "ชื่อสินค้า": "Bridgestone 750-15/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0109",
            "ชื่อสินค้า": "Bridgestone 700-16/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0110",
            "ชื่อสินค้า": "Bridgestone 750-16/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0110",
            "ชื่อสินค้า": "Bridgestone 750-16/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0110",
            "ชื่อสินค้า": "Bridgestone 750-16/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0112",
            "ชื่อสินค้า": "Bridgestone 825-16/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0112",
            "ชื่อสินค้า": "Bridgestone 825-16/12  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0113",
            "ชื่อสินค้า": "Bridgestone 825-16/14  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0113",
            "ชื่อสินค้า": "Bridgestone 825-16/14  MR"
        },
        {
            "รหัสจากโรงงาน": "115-10-0113",
            "ชื่อสินค้า": "Bridgestone 825-16/14  MR"
        },
        {
            "รหัสจากโรงงาน": "115-11-0108",
            "ชื่อสินค้า": "Bridgestone 1000-20/16  UL"
        },
        {
            "รหัสจากโรงงาน": "115-11-0108",
            "ชื่อสินค้า": "Bridgestone 1000-20/16  UL"
        },
        {
            "รหัสจากโรงงาน": "115-11-0303",
            "ชื่อสินค้า": "Bridgestone 900-20/14 HM"
        },
        {
            "รหัสจากโรงงาน": "115-11-0303",
            "ชื่อสินค้า": "Bridgestone 900-20/14 HM"
        },
        {
            "รหัสจากโรงงาน": "115-11-0303",
            "ชื่อสินค้า": "Bridgestone 900-20/14 HM"
        },
        {
            "รหัสจากโรงงาน": "115-11-0407",
            "ชื่อสินค้า": "Bridgestone 1000-20/16  LM"
        },
        {
            "รหัสจากโรงงาน": "115-11-0407",
            "ชื่อสินค้า": "Bridgestone 1000-20/16  LM"
        },
        {
            "รหัสจากโรงงาน": "115-11-0407",
            "ชื่อสินค้า": "Bridgestone 1000-20/16  LM"
        },
        {
            "รหัสจากโรงงาน": "115-11-0902",
            "ชื่อสินค้า": "Bridgestone 1000-20/16  R-157"
        },
        {
            "รหัสจากโรงงาน": "115-11-0904",
            "ชื่อสินค้า": "Bridgestone 11 R22.5  R-157"
        },
        {
            "รหัสจากโรงงาน": "115-11-0904",
            "ชื่อสินค้า": "Bridgestone 11 R22.5  R-157"
        },
        {
            "รหัสจากโรงงาน": "115-11-0904",
            "ชื่อสินค้า": "Bridgestone 11 R22.5  R-157"
        },
        {
            "รหัสจากโรงงาน": "115-11-0904",
            "ชื่อสินค้า": "Bridgestone 11 R22.5  R-157"
        },
        {
            "รหัสจากโรงงาน": "115-11-1001",
            "ชื่อสินค้า": "Bridgestone 900-20/14  M-789"
        },
        {
            "รหัสจากโรงงาน": "115-11-1001",
            "ชื่อสินค้า": "Bridgestone 900-20/14  M-789"
        },
        {
            "รหัสจากโรงงาน": "115-11-1001",
            "ชื่อสินค้า": "Bridgestone 900-20/14  M-789"
        },
        {
            "รหัสจากโรงงาน": "115-11-1002",
            "ชื่อสินค้า": "Bridgestone 1000-20/16  M-789"
        },
        {
            "รหัสจากโรงงาน": "115-11-1002",
            "ชื่อสินค้า": "Bridgestone 1000-20/16  M-789"
        },
        {
            "รหัสจากโรงงาน": "115-11-1401",
            "ชื่อสินค้า": "Bridgestone 295/80 R22.5 R-159"
        },
        {
            "รหัสจากโรงงาน": "115-11-1401",
            "ชื่อสินค้า": "Bridgestone 295/80 R22.5 R-159"
        },
        {
            "รหัสจากโรงงาน": "115-11-1501",
            "ชื่อสินค้า": "Bridgestone 900-20/14 R-156"
        },
        {
            "รหัสจากโรงงาน": "115-11-1503",
            "ชื่อสินค้า": "Bridgestone 11 R22.5 R-156"
        },
        {
            "รหัสจากโรงงาน": "115-11-1503",
            "ชื่อสินค้า": "Bridgestone 11 R22.5 R-156"
        },
        {
            "รหัสจากโรงงาน": "115-11-1503",
            "ชื่อสินค้า": "Bridgestone 11 R22.5 R-156"
        },
        {
            "รหัสจากโรงงาน": "115-11-1601",
            "ชื่อสินค้า": "Bridgestone 1000 R20 M-840"
        },
        {
            "รหัสจากโรงงาน": "115-11-1601",
            "ชื่อสินค้า": "Bridgestone 1000 R20 M-840"
        },
        {
            "รหัสจากโรงงาน": "115-11-1601",
            "ชื่อสินค้า": "Bridgestone 1000 R20 M-840"
        },
        {
            "รหัสจากโรงงาน": "115-98-0009",
            "ชื่อสินค้า": "ยางใน BS 650/700-15  TR-75A"
        },
        {
            "รหัสจากโรงงาน": "115-98-0011",
            "ชื่อสินค้า": "ยางใน BS 650/700-16  TR-177A"
        },
        {
            "รหัสจากโรงงาน": "115-98-0012",
            "ชื่อสินค้า": "ยางใน BS 750-15  TR-75A"
        },
        {
            "รหัสจากโรงงาน": "115-98-0014",
            "ชื่อสินค้า": "ยางใน BS 750-16  TR-77A"
        },
        {
            "รหัสจากโรงงาน": "115-98-0015",
            "ชื่อสินค้า": "ยางใน BS 825-16  TR-77A"
        },
        {
            "รหัสจากโรงงาน": "115-98-0016",
            "ชื่อสินค้า": "ยางใน BS 1000-20  TR-78A"
        },
        {
            "รหัสจากโรงงาน": "115-98-0020",
            "ชื่อสินค้า": "ยางใน BS 900-20  TR-175A"
        },
        {
            "รหัสจากโรงงาน": "115-98-0101",
            "ชื่อสินค้า": "ยางใน BS 900-20  TBR"
        },
        {
            "รหัสจากโรงงาน": "115-98-0102",
            "ชื่อสินค้า": "ยางใน BS 1000-20  TBR"
        },
        {
            "รหัสจากโรงงาน": "115-99-0001",
            "ชื่อสินค้า": "ยางรอง BS 650/700/750-15"
        },
        {
            "รหัสจากโรงงาน": "115-99-0002",
            "ชื่อสินค้า": "ยางรอง BS 650/700/750/825-16"
        },
        {
            "รหัสจากโรงงาน": "115-99-0004",
            "ชื่อสินค้า": "ยางรอง BS 900-20"
        },
        {
            "รหัสจากโรงงาน": "115-99-0006",
            "ชื่อสินค้า": "ยางรอง BS 1000/1100/1200-20"
        },
        {
            "รหัสจากโรงงาน": "115-99-0101",
            "ชื่อสินค้า": "ยางรอง BS 900/1000-20 TBR"
        },
        {
            "รหัสจากโรงงาน": "116-04-0701",
            "ชื่อสินค้า": "Bridgestone 265/65-17  D-684 (INDO)"
        },
        {
            "รหัสจากโรงงาน": "116-04-0701",
            "ชื่อสินค้า": "Bridgestone 265/65-17  D-684 (INDO)"
        },
        {
            "รหัสจากโรงงาน": "118-11-0101",
            "ชื่อสินค้า": "DAYTON 11 R22.5 DT-950M"
        },
        {
            "รหัสจากโรงงาน": "118-11-0101",
            "ชื่อสินค้า": "DAYTON 11 R22.5 DT-950M"
        },
        {
            "รหัสจากโรงงาน": "118-11-0102",
            "ชื่อสินค้า": "DAYTON 1000 R20 DT-950M"
        },
        {
            "รหัสจากโรงงาน": "118-11-0102",
            "ชื่อสินค้า": "DAYTON 1000 R20 DT-950M"
        },
        {
            "รหัสจากโรงงาน": "118-11-0102",
            "ชื่อสินค้า": "DAYTON 1000 R20 DT-950M"
        },
        {
            "รหัสจากโรงงาน": "118-11-0201",
            "ชื่อสินค้า": "DAYTON 11 R22.5 DT-590"
        },
        {
            "รหัสจากโรงงาน": "118-11-0202",
            "ชื่อสินค้า": "DAYTON 1000 R20 DT-590"
        },
        {
            "รหัสจากโรงงาน": "118-11-0202",
            "ชื่อสินค้า": "DAYTON 1000 R20 DT-590"
        },
        {
            "รหัสจากโรงงาน": "118-11-0202",
            "ชื่อสินค้า": "DAYTON 1000 R20 DT-590"
        },
        {
            "รหัสจากโรงงาน": "119-11-0101",
            "ชื่อสินค้า": "HUMSUNG 295/80 R22.5 S02"
        },
        {
            "รหัสจากโรงงาน": "119-11-0101",
            "ชื่อสินค้า": "HUMSUNG 295/80 R22.5 S02"
        },
        {
            "รหัสจากโรงงาน": "119-11-0102",
            "ชื่อสินค้า": "HUMSUNG 11 R22.5 S02"
        },
        {
            "รหัสจากโรงงาน": "119-11-0201",
            "ชื่อสินค้า": "HUMSUNG 11 R22.5 S09"
        },
        {
            "รหัสจากโรงงาน": "123-01-0101",
            "ชื่อสินค้า": "YOKOHAMA 185/60 R15 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0101",
            "ชื่อสินค้า": "YOKOHAMA 185/60 R15 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0101",
            "ชื่อสินค้า": "YOKOHAMA 185/60 R15 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0102",
            "ชื่อสินค้า": "YOKOHAMA 215/55 R17 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0102",
            "ชื่อสินค้า": "YOKOHAMA 215/55 R17 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0102",
            "ชื่อสินค้า": "YOKOHAMA 215/55 R17 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0103",
            "ชื่อสินค้า": "YOKOHAMA 205/55 R16 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0103",
            "ชื่อสินค้า": "YOKOHAMA 205/55 R16 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0103",
            "ชื่อสินค้า": "YOKOHAMA 205/55 R16 E70"
        },
        {
            "รหัสจากโรงงาน": "123-01-0301",
            "ชื่อสินค้า": "YOKOHAMA 215/60 R16 E75FZ"
        },
        {
            "รหัสจากโรงงาน": "123-01-0501",
            "ชื่อสินค้า": "YOKOHAMA 175/65 R15 E50JA"
        },
        {
            "รหัสจากโรงงาน": "123-01-0501",
            "ชื่อสินค้า": "YOKOHAMA 175/65 R15 E50JA"
        },
        {
            "รหัสจากโรงงาน": "123-01-1504",
            "ชื่อสินค้า": "YOKOHAMA 205/55 R16 AA01"
        },
        {
            "รหัสจากโรงงาน": "123-01-2712",
            "ชื่อสินค้า": "YOKOHAMA 185/55 R16 AE50"
        },
        {
            "รหัสจากโรงงาน": "123-01-2732",
            "ชื่อสินค้า": "YOKOHAMA 195/50 R16 AE50"
        },
        {
            "รหัสจากโรงงาน": "123-01-2803",
            "ชื่อสินค้า": "YOKOHAMA 185/55 R16 ES32"
        },
        {
            "รหัสจากโรงงาน": "123-01-2805",
            "ชื่อสินค้า": "YOKOHAMA 185/60 R15 ES32"
        },
        {
            "รหัสจากโรงงาน": "123-01-2915",
            "ชื่อสินค้า": "YOKOHAMA 185/55 R16 AE51"
        },
        {
            "รหัสจากโรงงาน": "123-02-0503",
            "ชื่อสินค้า": "YOKOHAMA 215/70 R15 RY55"
        },
        {
            "รหัสจากโรงงาน": "123-02-0503",
            "ชื่อสินค้า": "YOKOHAMA 215/70 R15 RY55"
        },
        {
            "รหัสจากโรงงาน": "123-02-0503",
            "ชื่อสินค้า": "YOKOHAMA 215/70 R15 RY55"
        },
        {
            "รหัสจากโรงงาน": "123-02-0504",
            "ชื่อสินค้า": "YOKOHAMA 225/70 R15 RY55"
        },
        {
            "รหัสจากโรงงาน": "123-04-0101",
            "ชื่อสินค้า": "YOKOHAMA 265/65 R17 G94CV"
        },
        {
            "รหัสจากโรงงาน": "123-04-0218",
            "ชื่อสินค้า": "YOKOHAMA 235/50 R19 G058"
        },
        {
            "รหัสจากโรงงาน": "123-04-2101",
            "ชื่อสินค้า": "YOKOHAMA 265/50 R20 PA02"
        },
        {
            "รหัสจากโรงงาน": "123-04-2101",
            "ชื่อสินค้า": "YOKOHAMA 265/50 R20 PA02"
        },
        {
            "รหัสจากโรงงาน": "123-04-2317",
            "ชื่อสินค้า": "YOKOHAMA 235/55 R18 G055"
        },
        {
            "รหัสจากโรงงาน": "123-04-2402",
            "ชื่อสินค้า": "YOKOHAMA 245/70 R16 G056"
        },
        {
            "รหัสจากโรงงาน": "123-04-2404",
            "ชื่อสินค้า": "YOKOHAMA 265/70 R16 G056"
        },
        {
            "รหัสจากโรงงาน": "123-04-2404",
            "ชื่อสินค้า": "YOKOHAMA 265/70 R16 G056"
        },
        {
            "รหัสจากโรงงาน": "123-04-2407",
            "ชื่อสินค้า": "YOKOHAMA 265/65 R17 G056"
        },
        {
            "รหัสจากโรงงาน": "123-04-2409",
            "ชื่อสินค้า": "YOKOHAMA 265/60 R18 G056"
        },
        {
            "รหัสจากโรงงาน": "124-01-0101",
            "ชื่อสินค้า": "Alliance 175/70 R13 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0102",
            "ชื่อสินค้า": "Alliance 185/60 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0102",
            "ชื่อสินค้า": "Alliance 185/60 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0104",
            "ชื่อสินค้า": "Alliance 185/65 R14 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0104",
            "ชื่อสินค้า": "Alliance 185/65 R14 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0107",
            "ชื่อสินค้า": "Alliance 195/55 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0107",
            "ชื่อสินค้า": "Alliance 195/55 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0108",
            "ชื่อสินค้า": "Alliance 195/60 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0108",
            "ชื่อสินค้า": "Alliance 195/60 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0110",
            "ชื่อสินค้า": "Alliance 195/65 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0110",
            "ชื่อสินค้า": "Alliance 195/65 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0110",
            "ชื่อสินค้า": "Alliance 195/65 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0111",
            "ชื่อสินค้า": "Alliance 205/55 R16 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0111",
            "ชื่อสินค้า": "Alliance 205/55 R16 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0111",
            "ชื่อสินค้า": "Alliance 205/55 R16 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0111",
            "ชื่อสินค้า": "Alliance 205/55 R16 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0114",
            "ชื่อสินค้า": "Alliance 225/45 R17 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0116",
            "ชื่อสินค้า": "Alliance 215/50 R17 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0116",
            "ชื่อสินค้า": "Alliance 215/50 R17 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0117",
            "ชื่อสินค้า": "Alliance 225/50 R17 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0118",
            "ชื่อสินค้า": "Alliance 225/40 R18 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0119",
            "ชื่อสินค้า": "Alliance 185/55 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0119",
            "ชื่อสินค้า": "Alliance 185/55 R15 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0121",
            "ชื่อสินค้า": "Alliance 215/60 R16 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0122",
            "ชื่อสินค้า": "Alliance 225/55 R17 AL30"
        },
        {
            "รหัสจากโรงงาน": "124-01-0201",
            "ชื่อสินค้า": "Alliance 205/45 R17 AL40"
        },
        {
            "รหัสจากโรงงาน": "124-04-0101",
            "ชื่อสินค้า": "Alliance 265/60 R18 AL40"
        },
        {
            "รหัสจากโรงงาน": "125-98-0401",
            "ชื่อสินค้า": "ยางใน KUMHO 1100-20"
        },
        {
            "รหัสจากโรงงาน": "125-98-0504",
            "ชื่อสินค้า": "ยางใน YOKO 650-10"
        },
        {
            "รหัสจากโรงงาน": "125-99-0001",
            "ชื่อสินค้า": "ยางรอง TNS  700/750-15"
        },
        {
            "รหัสจากโรงงาน": "125-99-0002",
            "ชื่อสินค้า": "ยางรอง TNS  750/825-16"
        },
        {
            "รหัสจากโรงงาน": "125-99-0003",
            "ชื่อสินค้า": "ยางรอง TNS  900-20"
        },
        {
            "รหัสจากโรงงาน": "125-99-0004",
            "ชื่อสินค้า": "ยางรอง TNS  1000/1100-20"
        },
        {
            "รหัสจากโรงงาน": "125-99-0009",
            "ชื่อสินค้า": "ยางรอง TNS 24\""
        },
        {
            "รหัสจากโรงงาน": "125-99-5001",
            "ชื่อสินค้า": "ยางรอง TR  900/1000-20"
        },
        {
            "รหัสจากโรงงาน": "126-98-0001",
            "ชื่อสินค้า": "ยางใน เกาหลี  15.5-25"
        },
        {
            "รหัสจากโรงงาน": "126-98-0002",
            "ชื่อสินค้า": "ยางใน เกาหลี  17.5-25"
        },
        {
            "รหัสจากโรงงาน": "126-98-0003",
            "ชื่อสินค้า": "ยางใน เกาหลี  20.5-25"
        },
        {
            "รหัสจากโรงงาน": "126-98-0004",
            "ชื่อสินค้า": "ยางใน เกาหลี  23.5.25"
        },
        {
            "รหัสจากโรงงาน": "126-98-0005",
            "ชื่อสินค้า": "ยางใน เกาหลี  26.5-25"
        },
        {
            "รหัสจากโรงงาน": "126-98-0006",
            "ชื่อสินค้า": "ยางใน เกาหลี  23.1-26"
        },
        {
            "รหัสจากโรงงาน": "126-98-0007",
            "ชื่อสินค้า": "ยางใน เกาหลี  16.9-24"
        },
        {
            "รหัสจากโรงงาน": "126-98-0008",
            "ชื่อสินค้า": "ยางใน เกาหลี  18.4-26"
        },
        {
            "รหัสจากโรงงาน": "126-98-0016",
            "ชื่อสินค้า": "ยางใน เกาหลี  16.9/14-28 TR-218A"
        },
        {
            "รหัสจากโรงงาน": "126-98-0018",
            "ชื่อสินค้า": "ยางใน เกาหลี 12.00-24 TR78A"
        },
        {
            "รหัสจากโรงงาน": "126-98-0022",
            "ชื่อสินค้า": "ยางใน เกาหลี 15-34"
        },
        {
            "รหัสจากโรงงาน": "126-98-0025",
            "ชื่อสินค้า": "ยางใน เกาหลี 18.4/15-30"
        },
        {
            "รหัสจากโรงงาน": "126-98-0102",
            "ชื่อสินค้า": "ยางใน เกาหลี 750-16 TR15(สั้น)"
        },
        {
            "รหัสจากโรงงาน": "126-98-0103",
            "ชื่อสินค้า": "ยางใน เกาหลี  825-16"
        },
        {
            "รหัสจากโรงงาน": "126-98-0104",
            "ชื่อสินค้า": "ยางใน เกาหลี  900-20"
        },
        {
            "รหัสจากโรงงาน": "126-98-0109",
            "ชื่อสินค้า": "ยางใน เกาหลี 825-20"
        },
        {
            "รหัสจากโรงงาน": "126-98-0111",
            "ชื่อสินค้า": "ยางใน เกาหลี 400/500-12"
        },
        {
            "รหัสจากโรงงาน": "126-98-0112",
            "ชื่อสินค้า": "ยางใน เกาหลี 15.00-20"
        },
        {
            "รหัสจากโรงงาน": "126-98-0113",
            "ชื่อสินค้า": "ยางใน เกาหลี 750-15 จุ้บสั้น(ผอม)"
        },
        {
            "รหัสจากโรงงาน": "126-98-0114",
            "ชื่อสินค้า": "ยางใน เกาหลี 550/600-15 TR75A"
        },
        {
            "รหัสจากโรงงาน": "126-98-0117",
            "ชื่อสินค้า": "ยางใน เกาหลี 750-15 TR75A"
        },
        {
            "รหัสจากโรงงาน": "126-98-0118",
            "ชื่อสินค้า": "ยางใน เกาหลี 560-13 TR13"
        },
        {
            "รหัสจากโรงงาน": "126-98-0119",
            "ชื่อสินค้า": "ยางใน เกาหลี 600-14 TR13"
        },
        {
            "รหัสจากโรงงาน": "126-98-0120",
            "ชื่อสินค้า": "ยางใน เกาหลี 500-15"
        },
        {
            "รหัสจากโรงงาน": "126-98-0122",
            "ชื่อสินค้า": "ยางใน เกาหลี 750-16 TR13(สั้นผอม)"
        },
        {
            "รหัสจากโรงงาน": "126-98-0201",
            "ชื่อสินค้า": "ยางใน เกาหลี  12.5/80-18"
        },
        {
            "รหัสจากโรงงาน": "126-98-0204",
            "ชื่อสินค้า": "ยางใน เกาหลี  13.6/12-38"
        },
        {
            "รหัสจากโรงงาน": "126-98-0208",
            "ชื่อสินค้า": "ยางใน เกาหลี  9.5/9-22 TR-218A"
        },
        {
            "รหัสจากโรงงาน": "126-98-0210",
            "ชื่อสินค้า": "ยางใน เกาหลี  10.5-20 สั้น"
        },
        {
            "รหัสจากโรงงาน": "126-98-0213",
            "ชื่อสินค้า": "ยางใน เกาหลี(BKT) 14,16/70-20 TR179A"
        },
        {
            "รหัสจากโรงงาน": "126-98-0217",
            "ชื่อสินค้า": "ยางใน เกาหลี 28X9-15"
        },
        {
            "รหัสจากโรงงาน": "126-99-0006",
            "ชื่อสินค้า": "ยางรอง เกาหลี(BKT) 20.0-14,15.0-20"
        },
        {
            "รหัสจากโรงงาน": "126-99-0103",
            "ชื่อสินค้า": "ยางรอง เกาหลี 550/600-15"
        },
        {
            "รหัสจากโรงงาน": "126-99-5001",
            "ชื่อสินค้า": "ยางรอง DONG AH 23.5-25"
        },
        {
            "รหัสจากโรงงาน": "126-99-5002",
            "ชื่อสินค้า": "ยางรอง DONG AH 26.5-25"
        },
        {
            "รหัสจากโรงงาน": "126-99-5003",
            "ชื่อสินค้า": "ยางรอง DONG AH 15.5/17.5-25"
        },
        {
            "รหัสจากโรงงาน": "126-99-5004",
            "ชื่อสินค้า": "ยางรอง DONG AH 20.5-25"
        },
        {
            "รหัสจากโรงงาน": "129-11-0204",
            "ชื่อสินค้า": "ยางนอก HH 1000-20/16  หลัง"
        },
        {
            "รหัสจากโรงงาน": "132-01-0305",
            "ชื่อสินค้า": "Apollo 185/65 R14 AMAZER 3G MAXX"
        },
        {
            "รหัสจากโรงงาน": "132-01-0811",
            "ชื่อสินค้า": "Apollo 225/45 R18 ASPIRE 4G"
        },
        {
            "รหัสจากโรงงาน": "132-01-0813",
            "ชื่อสินค้า": "Apollo 205/45 R17 ASPIRE 4G"
        },
        {
            "รหัสจากโรงงาน": "132-01-0831",
            "ชื่อสินค้า": "Apollo 245/35 R20 ASPIRE 4G"
        },
        {
            "รหัสจากโรงงาน": "132-01-0908",
            "ชื่อสินค้า": "Apollo 185/60 R15 ALNAC 4G"
        },
        {
            "รหัสจากโรงงาน": "132-02-0105",
            "ชื่อสินค้า": "Apollo 215/70 R15 ALTRUST"
        },
        {
            "รหัสจากโรงงาน": "132-02-0107",
            "ชื่อสินค้า": "Apollo 215/65 R16 ALTRUST"
        },
        {
            "รหัสจากโรงงาน": "132-04-0403",
            "ชื่อสินค้า": "Apollo 215/65 R16 APTERRA/HT-2"
        },
        {
            "รหัสจากโรงงาน": "132-04-0413",
            "ชื่อสินค้า": "Apollo 265/65 R17 APTERRA/HT-2"
        },
        {
            "รหัสจากโรงงาน": "132-10-0202",
            "ชื่อสินค้า": "Apollo 825-16/16 AMAR DELUXE"
        },
        {
            "รหัสจากโรงงาน": "132-10-0203",
            "ชื่อสินค้า": "Apollo 825 R16/16 ENDURACE RA-E"
        },
        {
            "รหัสจากโรงงาน": "132-10-0204",
            "ชื่อสินค้า": "Apollo 9.5 R1.75 ENDURACE RA-E"
        },
        {
            "รหัสจากโรงงาน": "132-10-0204",
            "ชื่อสินค้า": "Apollo 9.5 R1.75 ENDURACE RA-E"
        },
        {
            "รหัสจากโรงงาน": "132-10-0302",
            "ชื่อสินค้า": "Apollo 825-16/16 MILE STAR"
        },
        {
            "รหัสจากโรงงาน": "132-11-0102",
            "ชื่อสินค้า": "Apollo 1000 R20 MA-326E"
        },
        {
            "รหัสจากโรงงาน": "132-11-0601",
            "ชื่อสินค้า": "Apollo 11 R22.5 SOD"
        },
        {
            "รหัสจากโรงงาน": "132-11-0601",
            "ชื่อสินค้า": "Apollo 11 R22.5 SOD"
        },
        {
            "รหัสจากโรงงาน": "132-11-0602",
            "ชื่อสินค้า": "Apollo 1000 R20/16 SOD"
        },
        {
            "รหัสจากโรงงาน": "132-11-0602",
            "ชื่อสินค้า": "Apollo 1000 R20/16 SOD"
        },
        {
            "รหัสจากโรงงาน": "132-11-0701",
            "ชื่อสินค้า": "Apollo 1000-20/16 AWR-E(หน้า)"
        },
        {
            "รหัสจากโรงงาน": "132-11-0701",
            "ชื่อสินค้า": "Apollo 1000-20/16 AWR-E(หน้า)"
        },
        {
            "รหัสจากโรงงาน": "132-11-0801",
            "ชื่อสินค้า": "Apollo 1000-20/16 AXVD-E(หลัง)"
        },
        {
            "รหัสจากโรงงาน": "132-11-0801",
            "ชื่อสินค้า": "Apollo 1000-20/16 AXVD-E(หลัง)"
        },
        {
            "รหัสจากโรงงาน": "132-11-1201",
            "ชื่อสินค้า": "Apollo 11 R22.5 ET-MA"
        },
        {
            "รหัสจากโรงงาน": "132-11-1201",
            "ชื่อสินค้า": "Apollo 11 R22.5 ET-MA"
        },
        {
            "รหัสจากโรงงาน": "132-11-1402",
            "ชื่อสินค้า": "Apollo 295/80 R22.5 ENDURACE RA-E"
        },
        {
            "รหัสจากโรงงาน": "132-11-1501",
            "ชื่อสินค้า": "Apollo 11 R22.5 ENDURACE RA(XP)"
        },
        {
            "รหัสจากโรงงาน": "132-11-1501",
            "ชื่อสินค้า": "Apollo 11 R22.5 ENDURACE RA(XP)"
        },
        {
            "รหัสจากโรงงาน": "132-11-1501",
            "ชื่อสินค้า": "Apollo 11 R22.5 ENDURACE RA(XP)"
        },
        {
            "รหัสจากโรงงาน": "132-11-1601",
            "ชื่อสินค้า": "Apollo 11 R22.5 ENDURACE RT"
        },
        {
            "รหัสจากโรงงาน": "132-11-1601",
            "ชื่อสินค้า": "Apollo 11 R22.5 ENDURACE RT"
        },
        {
            "รหัสจากโรงงาน": "132-11-1801",
            "ชื่อสินค้า": "Apollo 295/80 R22.5 EnduComftCATL"
        },
        {
            "รหัสจากโรงงาน": "132-22-0101",
            "ชื่อสินค้า": "Apollo 9.5-24/8 FX515(ไถนา-หลัง)"
        },
        {
            "รหัสจากโรงงาน": "132-22-0102",
            "ชื่อสินค้า": "Apollo 12.4-24/8 FX515(ไถนา-หลัง)"
        },
        {
            "รหัสจากโรงงาน": "132-22-0301",
            "ชื่อสินค้า": "Apollo 16.9-30/8 FX525(ไถนา-หลัง)"
        },
        {
            "รหัสจากโรงงาน": "132-22-0401",
            "ชื่อสินค้า": "Apollo 8-18/6 FX212(ไถนา-หลัง)"
        },
        {
            "รหัสจากโรงงาน": "132-22-0501",
            "ชื่อสินค้า": "Apollo 13.6-26/6 FX222(ไถนา-หลัง)"
        },
        {
            "รหัสจากโรงงาน": "132-25-0101",
            "ชื่อสินค้า": "Apollo 14.00-24/12 ARG217"
        },
        {
            "รหัสจากโรงงาน": "132-25-0301",
            "ชื่อสินค้า": "Apollo 12.5/80-18 AIT426 TL"
        },
        {
            "รหัสจากโรงงาน": "132-25-0301",
            "ชื่อสินค้า": "Apollo 12.5/80-18 AIT426 TL"
        },
        {
            "รหัสจากโรงงาน": "132-25-0301",
            "ชื่อสินค้า": "Apollo 12.5/80-18 AIT426 TL"
        },
        {
            "รหัสจากโรงงาน": "132-25-0301",
            "ชื่อสินค้า": "Apollo 12.5/80-18 AIT426 TL"
        },
        {
            "รหัสจากโรงงาน": "132-98-0002",
            "ชื่อสินค้า": "ยางใน APL 825-16"
        },
        {
            "รหัสจากโรงงาน": "132-98-0102",
            "ชื่อสินค้า": "ยางใน APL 1000 R20"
        },
        {
            "รหัสจากโรงงาน": "132-99-0002",
            "ชื่อสินค้า": "ยางรอง APL 825-16"
        },
        {
            "รหัสจากโรงงาน": "132-99-0102",
            "ชื่อสินค้า": "ยางรอง APL 1000 R20"
        },
        {
            "รหัสจากโรงงาน": "133-04-0602",
            "ชื่อสินค้า": "GT Radial 265/75 R16 ADVENTURO M/T"
        },
        {
            "รหัสจากโรงงาน": "133-04-0603",
            "ชื่อสินค้า": "GT Radial 31X10.5 R15 ADVENTURO M/T"
        },
        {
            "รหัสจากโรงงาน": "136-11-0101",
            "ชื่อสินค้า": "Advance 1000-20/18 GL274A(หน้า)"
        },
        {
            "รหัสจากโรงงาน": "136-11-0201",
            "ชื่อสินค้า": "Advance 1000-20/18 GL671A(หลัง)"
        },
        {
            "รหัสจากโรงงาน": "136-11-0401",
            "ชื่อสินค้า": "Advance 295/80 R22.5 GL282A"
        },
        {
            "รหัสจากโรงงาน": "136-11-0501",
            "ชื่อสินค้า": "Advance 11 R22.5/16 GL665A"
        },
        {
            "รหัสจากโรงงาน": "136-98-0007",
            "ชื่อสินค้า": "ยางใน ADV 1000-20 TR-78A"
        },
        {
            "รหัสจากโรงงาน": "136-98-0009",
            "ชื่อสินค้า": "ยางใน ADV 1300/1400-24 TR-218A(สั้น)"
        },
        {
            "รหัสจากโรงงาน": "136-99-0005",
            "ชื่อสินค้า": "ยางรอง ADV 1000-20"
        },
        {
            "รหัสจากโรงงาน": "137-01-0103",
            "ชื่อสินค้า": "Landsail 205/45 R16 LS588"
        },
        {
            "รหัสจากโรงงาน": "137-01-0104",
            "ชื่อสินค้า": "Landsail 225/40 R18 LS588"
        },
        {
            "รหัสจากโรงงาน": "137-01-0202",
            "ชื่อสินค้า": "Landsail 195/50 R16 LS388"
        },
        {
            "รหัสจากโรงงาน": "140-01-0103",
            "ชื่อสินค้า": "DELINTE 195/55 R15 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0103",
            "ชื่อสินค้า": "DELINTE 195/55 R15 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0103",
            "ชื่อสินค้า": "DELINTE 195/55 R15 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0103",
            "ชื่อสินค้า": "DELINTE 195/55 R15 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0103",
            "ชื่อสินค้า": "DELINTE 195/55 R15 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0104",
            "ชื่อสินค้า": "DELINTE 195/60 R15 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0105",
            "ชื่อสินค้า": "DELINTE 195/65 R15 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0107",
            "ชื่อสินค้า": "DELINTE 205/55 R16 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0107",
            "ชื่อสินค้า": "DELINTE 205/55 R16 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0107",
            "ชื่อสินค้า": "DELINTE 205/55 R16 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0107",
            "ชื่อสินค้า": "DELINTE 205/55 R16 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0109",
            "ชื่อสินค้า": "DELINTE 215/50 R17 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0109",
            "ชื่อสินค้า": "DELINTE 215/50 R17 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0109",
            "ชื่อสินค้า": "DELINTE 215/50 R17 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0110",
            "ชื่อสินค้า": "DELINTE 215/55 R17 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0110",
            "ชื่อสินค้า": "DELINTE 215/55 R17 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0110",
            "ชื่อสินค้า": "DELINTE 215/55 R17 DH2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0201",
            "ชื่อสินค้า": "DELINTE 205/40 R17 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0201",
            "ชื่อสินค้า": "DELINTE 205/40 R17 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0201",
            "ชื่อสินค้า": "DELINTE 205/40 R17 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0201",
            "ชื่อสินค้า": "DELINTE 205/40 R17 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0202",
            "ชื่อสินค้า": "DELINTE 205/45 R17 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0203",
            "ชื่อสินค้า": "DELINTE 215/45 R17 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0207",
            "ชื่อสินค้า": "DELINTE 205/50 R17 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0209",
            "ชื่อสินค้า": "DELINTE 225/55 R17 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0211",
            "ชื่อสินค้า": "DELINTE 225/40 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0211",
            "ชื่อสินค้า": "DELINTE 225/40 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0212",
            "ชื่อสินค้า": "DELINTE 235/40 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0212",
            "ชื่อสินค้า": "DELINTE 235/40 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0214",
            "ชื่อสินค้า": "DELINTE 225/45 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0214",
            "ชื่อสินค้า": "DELINTE 225/45 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0214",
            "ชื่อสินค้า": "DELINTE 225/45 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0215",
            "ชื่อสินค้า": "DELINTE 245/45 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0215",
            "ชื่อสินค้า": "DELINTE 245/45 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0226",
            "ชื่อสินค้า": "DELINTE 275/40 R18 D7"
        },
        {
            "รหัสจากโรงงาน": "140-01-0302",
            "ชื่อสินค้า": "DELINTE 255/50 R18 D8+"
        },
        {
            "รหัสจากโรงงาน": "140-01-0303",
            "ชื่อสินค้า": "DELINTE 255/55 R18 D8+"
        },
        {
            "รหัสจากโรงงาน": "140-01-0303",
            "ชื่อสินค้า": "DELINTE 255/55 R18 D8+"
        },
        {
            "รหัสจากโรงงาน": "140-01-0501",
            "ชื่อสินค้า": "DELINTE 185/65 R14 DS2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0502",
            "ชื่อสินค้า": "DELINTE 185/60 R15 DS2"
        },
        {
            "รหัสจากโรงงาน": "140-01-0511",
            "ชื่อสินค้า": "DELINTE 205/45 R17 DS2"
        },
        {
            "รหัสจากโรงงาน": "140-02-0102",
            "ชื่อสินค้า": "DELINTE 215/70 R15 DV2"
        },
        {
            "รหัสจากโรงงาน": "140-02-0102",
            "ชื่อสินค้า": "DELINTE 215/70 R15 DV2"
        },
        {
            "รหัสจากโรงงาน": "140-04-0102",
            "ชื่อสินค้า": "DELINTE 265/60 R18 DH7 SUV"
        },
        {
            "รหัสจากโรงงาน": "140-04-0102",
            "ชื่อสินค้า": "DELINTE 265/60 R18 DH7 SUV"
        },
        {
            "รหัสจากโรงงาน": "140-04-0102",
            "ชื่อสินค้า": "DELINTE 265/60 R18 DH7 SUV"
        },
        {
            "รหัสจากโรงงาน": "140-04-0104",
            "ชื่อสินค้า": "DELINTE 265/65 R17 DH7 SUV"
        },
        {
            "รหัสจากโรงงาน": "140-04-0201",
            "ชื่อสินค้า": "DELINTE 265/50 R20 DS8"
        },
        {
            "รหัสจากโรงงาน": "146-25-5001",
            "ชื่อสินค้า": "ANNAITE 23.5-25/24 G-2"
        },
        {
            "รหัสจากโรงงาน": "146-98-5001",
            "ชื่อสินค้า": "ยางใน ANNAITE 23.5-25"
        },
        {
            "รหัสจากโรงงาน": "146-99-5001",
            "ชื่อสินค้า": "ยางรอง ANNAITE 23.5-25"
        },
        {
            "รหัสจากโรงงาน": "147-22-5002",
            "ชื่อสินค้า": "BKT 16.9-28/12"
        },
        {
            "รหัสจากโรงงาน": "147-22-5002",
            "ชื่อสินค้า": "BKT 16.9-28/12"
        },
        {
            "รหัสจากโรงงาน": "147-22-5003",
            "ชื่อสินค้า": "BKT 9.5-22/6 ไถนา-หลัง"
        },
        {
            "รหัสจากโรงงาน": "147-22-5003",
            "ชื่อสินค้า": "BKT 9.5-22/6 ไถนา-หลัง"
        },
        {
            "รหัสจากโรงงาน": "147-22-5003",
            "ชื่อสินค้า": "BKT 9.5-22/6 ไถนา-หลัง"
        },
        {
            "รหัสจากโรงงาน": "147-22-5006",
            "ชื่อสินค้า": "BKT 8.3-24/8 TR135 T/T"
        },
        {
            "รหัสจากโรงงาน": "147-23-5001",
            "ชื่อสินค้า": "BKT 550-15/8 PL801"
        },
        {
            "รหัสจากโรงงาน": "147-23-5001",
            "ชื่อสินค้า": "BKT 550-15/8 PL801"
        },
        {
            "รหัสจากโรงงาน": "147-23-5101",
            "ชื่อสินค้า": "ยางตัน BKT 500-8/3 MAGLIFT"
        },
        {
            "รหัสจากโรงงาน": "147-24-5001",
            "ชื่อสินค้า": "BKT 14/70-20 ดอกเรียบ"
        },
        {
            "รหัสจากโรงงาน": "147-24-5001",
            "ชื่อสินค้า": "BKT 14/70-20 ดอกเรียบ"
        },
        {
            "รหัสจากโรงงาน": "147-25-5007",
            "ชื่อสินค้า": "BKT 16.9-24/12 TL"
        },
        {
            "รหัสจากโรงงาน": "147-25-5007",
            "ชื่อสินค้า": "BKT 16.9-24/12 TL"
        },
        {
            "รหัสจากโรงงาน": "151-23-0108",
            "ชื่อสินค้า": "ยางตัน SG 825-15 C6TT(HR)"
        },
        {
            "รหัสจากโรงงาน": "154-11-0102",
            "ชื่อสินค้า": "LINGLONG 1000-20/16 LL47"
        },
        {
            "รหัสจากโรงงาน": "154-98-0002",
            "ชื่อสินค้า": "ยางใน LL 1000-20"
        },
        {
            "รหัสจากโรงงาน": "154-99-0002",
            "ชื่อสินค้า": "ยางรอง LL 1000-20"
        },
        {
            "รหัสจากโรงงาน": "157-01-0201",
            "ชื่อสินค้า": "OTANI 205/45 R17 KC2000"
        },
        {
            "รหัสจากโรงงาน": "157-11-0101",
            "ชื่อสินค้า": "OTANI 11 R 22.5 OH-101"
        },
        {
            "รหัสจากโรงงาน": "157-11-0101",
            "ชื่อสินค้า": "OTANI 11 R 22.5 OH-101"
        },
        {
            "รหัสจากโรงงาน": "157-22-0106",
            "ชื่อสินค้า": "OTANI 16.9-28/8 F33(ไถนา)"
        },
        {
            "รหัสจากโรงงาน": "160-98-0001",
            "ชื่อสินค้า": "ยางใน BRONGO 15\"   จุ้บผอม"
        },
        {
            "รหัสจากโรงงาน": "160-98-0002",
            "ชื่อสินค้า": "ยางใน BRONGO 1400-24 TR-218A(สั้น)"
        },
        {
            "รหัสจากโรงงาน": "160-98-0003",
            "ชื่อสินค้า": "ยางใน BRONGO 1400-24 TR-179A(ยาว)"
        },
        {
            "รหัสจากโรงงาน": "160-98-0004",
            "ชื่อสินค้า": "ยางใน BRONGO 750-16 TR177A(ยาว)"
        },
        {
            "รหัสจากโรงงาน": "161-98-0102",
            "ชื่อสินค้า": "ยางใน KST 400/500-12"
        },
        {
            "รหัสจากโรงงาน": "161-98-6004",
            "ชื่อสินค้า": "ยางใน HEUNG AH 600-16 TR15"
        },
        {
            "รหัสจากโรงงาน": "161-98-6026",
            "ชื่อสินค้า": "ยางใน HEUNG-AH 16.0/70-20 TR218A(สั้น)"
        },
        {
            "รหัสจากโรงงาน": "164-01-0701",
            "ชื่อสินค้า": "Hankook 235/50-19 K125"
        },
        {
            "รหัสจากโรงงาน": "167-25-0101",
            "ชื่อสินค้า": "WESTLAKE 20.5/70-16 L36"
        },
        {
            "รหัสจากโรงงาน": "167-98-0101",
            "ชื่อสินค้า": "ยางใน WL 20.5/70-16"
        },
        {
            "รหัสจากโรงงาน": "167-99-0101",
            "ชื่อสินค้า": "ยางรอง WL 20.5/70-16"
        },
        {
            "รหัสจากโรงงาน": "169-11-0201",
            "ชื่อสินค้า": "JINYU 1000-20/16 JY-588"
        },
        {
            "รหัสจากโรงงาน": "169-11-0301",
            "ชื่อสินค้า": "ยางนอก JINYU 295/80 R22.5 JY-512"
        },
        {
            "รหัสจากโรงงาน": "169-98-0001",
            "ชื่อสินค้า": "ยางใน JINYU 1000-20 TR-78"
        },
        {
            "รหัสจากโรงงาน": "169-99-0001",
            "ชื่อสินค้า": "ยางรอง JINYU 1000-20"
        },
        {
            "รหัสจากโรงงาน": "171-98-0001",
            "ชื่อสินค้า": "ยางใน GOOD SEVEN 1000-20"
        },
        {
            "รหัสจากโรงงาน": "173-11-0201",
            "ชื่อสินค้า": "SAMSON 825-20/14 หลัง"
        },
        {
            "รหัสจากโรงงาน": "173-11-0201",
            "ชื่อสินค้า": "SAMSON 825-20/14 หลัง"
        },
        {
            "รหัสจากโรงงาน": "173-11-0201",
            "ชื่อสินค้า": "SAMSON 825-20/14 หลัง"
        },
        {
            "รหัสจากโรงงาน": "182-11-0101",
            "ชื่อสินค้า": "DOUBLE COIN 11 R22.5 RR680"
        },
        {
            "รหัสจากโรงงาน": "182-11-0101",
            "ชื่อสินค้า": "DOUBLE COIN 11 R22.5 RR680"
        },
        {
            "รหัสจากโรงงาน": "184-23-0101",
            "ชื่อสินค้า": "HENAN 28X9-15/14 AIND11 T/T"
        },
        {
            "รหัสจากโรงงาน": "184-98-0001",
            "ชื่อสินค้า": "ยางใน HENAN 28X9-15"
        },
        {
            "รหัสจากโรงงาน": "184-99-0001",
            "ชื่อสินค้า": "ยางรอง HENAN 28X9-15"
        },
        {
            "รหัสจากโรงงาน": "301-01-0001",
            "ชื่อสินค้า": "แบตเตอรี่ GS NS 40 PP"
        },
        {
            "รหัสจากโรงงาน": "301-01-0011",
            "ชื่อสินค้า": "แบตเตอรี่ GS S 95 ISS"
        },
        {
            "รหัสจากโรงงาน": "301-01-0014",
            "ชื่อสินค้า": "แบตเตอรี่ GS N 50 ZLPP"
        },
        {
            "รหัสจากโรงงาน": "301-01-0017",
            "ชื่อสินค้า": "แบตเตอรี่ GS N 100 PP"
        },
        {
            "รหัสจากโรงงาน": "301-01-0019",
            "ชื่อสินค้า": "แบตเตอรี่ GS N 120 PP"
        },
        {
            "รหัสจากโรงงาน": "301-01-0020",
            "ชื่อสินค้า": "แบตเตอรี่ GS N 150 PP"
        },
        {
            "รหัสจากโรงงาน": "301-01-0021",
            "ชื่อสินค้า": "แบตเตอรี่ GS N 200 PP"
        },
        {
            "รหัสจากโรงงาน": "301-01-0022",
            "ชื่อสินค้า": "แบตเตอรี่ GS LNO-DIN35"
        },
        {
            "รหัสจากโรงงาน": "301-01-0028",
            "ชื่อสินค้า": "แบตเตอรี่ GS 4DTLPP"
        },
        {
            "รหัสจากโรงงาน": "301-01-0029",
            "ชื่อสินค้า": "แบตเตอรี่ GS LN3-DIN75 DURA TOUGH"
        },
        {
            "รหัสจากโรงงาน": "301-01-0030",
            "ชื่อสินค้า": "แบตเตอรี่ GS LN2-DIN65 DURA TOUGH"
        },
        {
            "รหัสจากโรงงาน": "301-01-0031",
            "ชื่อสินค้า": "แบตเตอรี่ GS LN4-DIN85 DURA TOUGH"
        },
        {
            "รหัสจากโรงงาน": "301-01-0032",
            "ชื่อสินค้า": "แบตเตอรี่ GS LN5-DIN100 DURA TOUGH"
        },
        {
            "รหัสจากโรงงาน": "301-01-0033",
            "ชื่อสินค้า": "แบตเตอรี่ GS N-55 "
        },
        {
            "รหัสจากโรงงาน": "301-01-0034",
            "ชื่อสินค้า": "แบตเตอรี่ GS Q-85 "
        },
        {
            "รหัสจากโรงงาน": "301-01-0035",
            "ชื่อสินค้า": "แบตเตอรี่ GS LN4-DIN90 "
        },
        {
            "รหัสจากโรงงาน": "301-01-0080",
            "ชื่อสินค้า": "แบตเตอรี่ GS EX150R PLUS (WET)"
        },
        {
            "รหัสจากโรงงาน": "301-01-0081",
            "ชื่อสินค้า": "แบตเตอรี่ GS EX150L PLUS (WET)"
        },
        {
            "รหัสจากโรงงาน": "301-01-0097",
            "ชื่อสินค้า": "แบตเตอรี่ GS EX120R PLUS (WET)"
        },
        {
            "รหัสจากโรงงาน": "301-01-0098",
            "ชื่อสินค้า": "แบตเตอรี่ GS EX120L PLUS (WET)"
        },
        {
            "รหัสจากโรงงาน": "301-01-0101",
            "ชื่อสินค้า": "แบตเตอรี่ GS 46B24L MF-X"
        },
        {
            "รหัสจากโรงงาน": "301-01-0102",
            "ชื่อสินค้า": "แบตเตอรี่ GS LBN1-MF DURA TOUGH"
        },
        {
            "รหัสจากโรงงาน": "301-01-0103",
            "ชื่อสินค้า": "แบตเตอรี่ GS LBN3-MF DURA TOUGH"
        },
        {
            "รหัสจากโรงงาน": "301-01-0111",
            "ชื่อสินค้า": "แบตเตอรี่ GS 46B24R MF-X"
        },
        {
            "รหัสจากโรงงาน": "301-01-0115",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-50L"
        },
        {
            "รหัสจากโรงงาน": "301-01-0116",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-60L"
        },
        {
            "รหัสจากโรงงาน": "301-01-0117",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-70L"
        },
        {
            "รหัสจากโรงงาน": "301-01-0118",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-80L"
        },
        {
            "รหัสจากโรงงาน": "301-01-0119",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-90L"
        },
        {
            "รหัสจากโรงงาน": "301-01-0122",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-200R"
        },
        {
            "รหัสจากโรงงาน": "301-01-0123",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-200L"
        },
        {
            "รหัสจากโรงงาน": "301-01-0125",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-60R"
        },
        {
            "รหัสจากโรงงาน": "301-01-0127",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-80R"
        },
        {
            "รหัสจากโรงงาน": "301-01-0128",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-90R"
        },
        {
            "รหัสจากโรงงาน": "301-01-0133",
            "ชื่อสินค้า": "แบตเตอรี่ GS LBN3-MF"
        },
        {
            "รหัสจากโรงงาน": "301-01-0136",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-180R"
        },
        {
            "รหัสจากโรงงาน": "301-01-0137",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-180L"
        },
        {
            "รหัสจากโรงงาน": "301-01-0138",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-190R"
        },
        {
            "รหัสจากโรงงาน": "301-01-0139",
            "ชื่อสินค้า": "แบตเตอรี่ GS MFX-190L"
        },
        {
            "รหัสจากโรงงาน": "301-01-0201",
            "ชื่อสินค้า": "แบตเตอรี่ GS 65D23L-DL"
        },
        {
            "รหัสจากโรงงาน": "450-14-5502",
            "ชื่อสินค้า": "กะทะ USE-RIM  14X5.5  5H (T/T)"
        },
        {
            "รหัสจากโรงงาน": "450-15-0001",
            "ชื่อสินค้า": "กะทะ USE-RIM  15\"  5H เล็ก (NKR)"
        },
        {
            "รหัสจากโรงงาน": "450-15-0003",
            "ชื่อสินค้า": "กะทะ USE-RIM 15\" 6H(เพลาลอย)คิ้ว-แคนเตอร์ล้อเดี่ยว"
        },
        {
            "รหัสจากโรงงาน": "450-15-0004",
            "ชื่อสินค้า": "กะทะ USE-RIM 15\" 6H(เพลาลอย)คิ้ว-S250"
        },
        {
            "รหัสจากโรงงาน": "450-15-0005",
            "ชื่อสินค้า": "กะทะ USE-RIM 15\" 6H LN106(คานแข็ง)"
        },
        {
            "รหัสจากโรงงาน": "450-16-0001",
            "ชื่อสินค้า": "กะทะ USE-RIM  16\" 6H ฟูโซ่"
        },
        {
            "รหัสจากโรงงาน": "450-16-0002",
            "ชื่อสินค้า": "กะทะ USE-RIM  16\" 5H KS22"
        },
        {
            "รหัสจากโรงงาน": "450-16-0003",
            "ชื่อสินค้า": "กะทะ USE-RIM  16\" 5H (จุ้บเลส)"
        },
        {
            "รหัสจากโรงงาน": "450-20-0001",
            "ชื่อสินค้า": "กะทะ USE-RIM  900-20"
        },
        {
            "รหัสจากโรงงาน": "450-20-0002",
            "ชื่อสินค้า": "กะทะ USE-RIM 1100-20"
        },
        {
            "รหัสจากโรงงาน": "450-20-0003",
            "ชื่อสินค้า": "กะทะ USE-RIM 1000-20"
        },
        {
            "รหัสจากโรงงาน": "450-22-0002",
            "ชื่อสินค้า": "กะทะ USERIM  22.5X7.50 8H"
        },
        {
            "รหัสจากโรงงาน": "451-17-6002",
            "ชื่อสินค้า": "กะทะ SZC04 17.5 X 6.00 6H"
        },
        {
            "รหัสจากโรงงาน": "451-17-6003",
            "ชื่อสินค้า": "กะทะ MAXION 17.5X6.00 6H"
        },
        {
            "รหัสจากโรงงาน": "451-22-8204",
            "ชื่อสินค้า": "กะทะ MAXION 22.5X8.25X10H(VOLVO)"
        },
        {
            "รหัสจากโรงงาน": "451-22-8205",
            "ชื่อสินค้า": "กะทะ LEMMERZ 22.5X8.25X10H"
        },
        {
            "รหัสจากโรงงาน": "451-22-8206",
            "ชื่อสินค้า": "กะทะ LEMMERZ 22.5X8.25X8H"
        },
        {
            "รหัสจากโรงงาน": "452-14-6501",
            "ชื่อสินค้า": "กะทะเหล็ก TCPY 14X6.5 5H(วีโก้)"
        },
        {
            "รหัสจากโรงงาน": "453-15-0001",
            "ชื่อสินค้า": "กะทะล้อ TSA ขอบ 15\" 6H (เพลาลอย)คิ้ว-S250"
        },
        {
            "รหัสจากโรงงาน": "456-14-6501",
            "ชื่อสินค้า": "กะทะล้อ MG 14X6.5 5H(วีโก้)"
        },
        {
            "รหัสจากโรงงาน": "456-14-6502",
            "ชื่อสินค้า": "กะทะล้อ MG 14X6.5 6H(D-MAX)"
        },
        {
            "รหัสจากโรงงาน": "456-14-6503",
            "ชื่อสินค้า": "กะทะล้อ MG 14X6.5 6H(เพลาลอย)"
        },
        {
            "รหัสจากโรงงาน": "456-14-6504",
            "ชื่อสินค้า": "กะทะล้อ MG 14X6.5 5H(ไททั้น)"
        },
        {
            "รหัสจากโรงงาน": "456-15-7001",
            "ชื่อสินค้า": "กะทะล้อ MG 15X7 6H(D-MAX)"
        },
        {
            "รหัสจากโรงงาน": "456-15-7002",
            "ชื่อสินค้า": "กะทะล้อ MG 15X7 6H(นาวาร่า)"
        },
        {
            "รหัสจากโรงงาน": "456-15-7003",
            "ชื่อสินค้า": "กะทะล้อ MG 15X7 5H(วีโก้)"
        },
        {
            "รหัสจากโรงงาน": "456-15-7004",
            "ชื่อสินค้า": "กะทะล้อ MG 15X7 6H(เพลาลอย)"
        },
        {
            "รหัสจากโรงงาน": "456-15-7005",
            "ชื่อสินค้า": "กะทะล้อ MG 15X7 5H(ไททั้น)"
        },
        {
            "รหัสจากโรงงาน": "458-20-2001",
            "ชื่อสินค้า": "กะทะล้อ MEFRO 20X7.50 8H(1100-20)"
        },
        {
            "รหัสจากโรงงาน": "458-22-8201",
            "ชื่อสินค้า": "กะทะล้อ MEFRO 22.5X8.25 10H(VOLVO)"
        },
        {
            "รหัสจากโรงงาน": "459-16-0001",
            "ชื่อสินค้า": "กะทะล้อ MX ขอบ 16\" 5H"
        },
        {
            "รหัสจากโรงงาน": "459-16-0002",
            "ชื่อสินค้า": "กะทะล้อ MX ขอบ 16\" 6H"
        },
        {
            "รหัสจากโรงงาน": "459-17-6001",
            "ชื่อสินค้า": "กะทะล้อ MX 17.5X6.00  6H"
        },
        {
            "รหัสจากโรงงาน": "459-20-0001",
            "ชื่อสินค้า": "กะทะล้อ MX 1000-20 8H"
        },
        {
            "รหัสจากโรงงาน": "459-22-8201",
            "ชื่อสินค้า": "กะทะล้อ MX 22.5X8.25  8H"
        },
        {
            "รหัสจากโรงงาน": "459-22-8202",
            "ชื่อสินค้า": "กะทะล้อ MX 22.5X8.25  10H(VOLVO)"
        },
        {
            "รหัสจากโรงงาน": "459-22-8203",
            "ชื่อสินค้า": "กะทะล้อ MX 22.5X8.25  10H(BENZ)"
        },
        {
            "รหัสจากโรงงาน": "460-20-0001",
            "ชื่อสินค้า": "กะทะล้อ ACCURIDE 20X7.00 8H(1000-20)"
        },
        {
            "รหัสจากโรงงาน": "462-15-0002",
            "ชื่อสินค้า": "กะทะล้อใหม่ 15X6.5 6H (คานแข็ง)"
        },
        {
            "รหัสจากโรงงาน": "462-20-0001",
            "ชื่อสินค้า": "กะทะล้อใหม่ ขอบ 20\" 6H"
        },
        {
            "รหัสจากโรงงาน": "462-20-7501",
            "ชื่อสินค้า": "กะทะล้อ CENTURION 20X7.50 8H (1100-20)"
        },
        {
            "รหัสจากโรงงาน": "501-88-0454",
            "ชื่อสินค้า": "คิ้วกะทะ ขอบ 20\" (1100-20)"
        },
        {
            "รหัสจากโรงงาน": "501-88-0455",
            "ชื่อสินค้า": "คิ้วกะทะ ขอบ 20\"x7 (ใหม่)"
        },
        {
            "รหัสจากโรงงาน": "501-88-0456",
            "ชื่อสินค้า": "คิ้วกะทะ ขอบ 15\" (ใหม่)"
        },
        {
            "รหัสจากโรงงาน": "501-88-0457",
            "ชื่อสินค้า": "คิ้วกะทะ ขอบ 20\"x7.5 (ใหม่)"
        },
        {
            "รหัสจากโรงงาน": "501-88-0458",
            "ชื่อสินค้า": "คิ้วกะทะ ขอบ 16\" (ใหม่)"
        },
        {
            "รหัสจากโรงงาน": "201-01-0101",
            "ชื่อสินค้า": "MOBIL 1 FS X2 5W-50 4/4"
        },
        {
            "รหัสจากโรงงาน": "201-01-0102",
            "ชื่อสินค้า": "MOBIL 1 FS X2 5W-50 12/1"
        },
        {
            "รหัสจากโรงงาน": "201-01-0111",
            "ชื่อสินค้า": "MOBIL l TURBO DIESEL 5W-40  4/6"
        },
        {
            "รหัสจากโรงงาน": "201-01-0112",
            "ชื่อสินค้า": "MOBIL l TURBO DIESEL 5W-40  12/1"
        },
        {
            "รหัสจากโรงงาน": "201-01-0201",
            "ชื่อสินค้า": "MOBIL SUPER E.P. 20W-50 4/4"
        },
        {
            "รหัสจากโรงงาน": "201-01-0202",
            "ชื่อสินค้า": "MOBIL SUPER E.P. 20W-50 12/1"
        },
        {
            "รหัสจากโรงงาน": "201-01-0301",
            "ชื่อสินค้า": "MOBIL SUPER E.P. TBS 15W-40 4/7"
        },
        {
            "รหัสจากโรงงาน": "201-01-0505",
            "ชื่อสินค้า": "MOBIL DELVAC HD 10W   1/200"
        },
        {
            "รหัสจากโรงงาน": "201-01-0506",
            "ชื่อสินค้า": "MOBIL DELVAC HD 10W   1/18"
        },
        {
            "รหัสจากโรงงาน": "201-01-0507",
            "ชื่อสินค้า": "MOBIL DELVAC HD 10W   4/5"
        },
        {
            "รหัสจากโรงงาน": "201-01-0602",
            "ชื่อสินค้า": "MOBIL HD 30    6/5"
        },
        {
            "รหัสจากโรงงาน": "201-01-1605",
            "ชื่อสินค้า": "MOBIL SUPER 2000 TBS 10W-30  4/7"
        },
        {
            "รหัสจากโรงงาน": "201-01-1606",
            "ชื่อสินค้า": "MOBIL SUPER F.F. TBS 10W-30  4/7"
        },
        {
            "รหัสจากโรงงาน": "201-01-1607",
            "ชื่อสินค้า": "MOBIL SUPER F.F. TBS 10W-30  12/1"
        },
        {
            "รหัสจากโรงงาน": "201-01-1704",
            "ชื่อสินค้า": "MOBIL SUPER 1000 TBS 15W-40  12/1"
        },
        {
            "รหัสจากโรงงาน": "201-01-1905",
            "ชื่อสินค้า": "MOBIL SUPER F.F. 10W-40 4/4"
        },
        {
            "รหัสจากโรงงาน": "201-01-1906",
            "ชื่อสินค้า": "MOBIL SUPER F.F. 10W-40 12/1"
        },
        {
            "รหัสจากโรงงาน": "201-01-2102",
            "ชื่อสินค้า": "MOBIL SUPER 3000 5W-30 12/1"
        },
        {
            "รหัสจากโรงงาน": "201-01-2103",
            "ชื่อสินค้า": "MOBIL SUPER 3000 5W-30 4/6"
        },
        {
            "รหัสจากโรงงาน": "201-02-0201",
            "ชื่อสินค้า": "MOBIL DELVAC LEGEND CH-4 15W-40 4/7"
        },
        {
            "รหัสจากโรงงาน": "201-02-1705",
            "ชื่อสินค้า": "MOBIL DELVAC MX 15W-40 1/18"
        },
        {
            "รหัสจากโรงงาน": "201-02-1706",
            "ชื่อสินค้า": "MOBIL DELVAC MX 15W-40 1/208"
        },
        {
            "รหัสจากโรงงาน": "201-02-2104",
            "ชื่อสินค้า": "MOBIL DELVAC SUPER 20W-50 1/18"
        },
        {
            "รหัสจากโรงงาน": "201-02-2105",
            "ชื่อสินค้า": "MOBIL DELVAC SUPER 20W-50 1/208"
        },
        {
            "รหัสจากโรงงาน": "201-02-2303",
            "ชื่อสินค้า": "MOBIL DELVAC SUPER 1400 15W-40 4/6"
        },
        {
            "รหัสจากโรงงาน": "201-02-2304",
            "ชื่อสินค้า": "MOBIL DELVAC SUPER 1400 15W-40 12/1"
        },
        {
            "รหัสจากโรงงาน": "201-02-2401",
            "ชื่อสินค้า": "MOBIL DELVAC 1640  1/208"
        },
        {
            "รหัสจากโรงงาน": "201-02-2403",
            "ชื่อสินค้า": "MOBIL DELVAC 1640  4/6"
        },
        {
            "รหัสจากโรงงาน": "201-03-0206",
            "ชื่อสินค้า": "MOBILUBE HD 80W-90   4/5"
        },
        {
            "รหัสจากโรงงาน": "201-03-0207",
            "ชื่อสินค้า": "MOBILUBE HD 80W-90   1/18"
        },
        {
            "รหัสจากโรงงาน": "201-03-0210",
            "ชื่อสินค้า": "MOBILUBE HD 80W-90   1/208"
        },
        {
            "รหัสจากโรงงาน": "201-03-0306",
            "ชื่อสินค้า": "MOBILUBE HD 85W-140    4/5"
        },
        {
            "รหัสจากโรงงาน": "201-03-0310",
            "ชื่อสินค้า": "MOBILUBE HD 85W-140    1/208"
        },
        {
            "รหัสจากโรงงาน": "201-03-1001",
            "ชื่อสินค้า": "MOBILUBE LS 85W-90 12/1"
        },
        {
            "รหัสจากโรงงาน": "201-04-0105",
            "ชื่อสินค้า": "MOBIL ATF 220   12/1"
        },
        {
            "รหัสจากโรงงาน": "201-04-0401",
            "ชื่อสินค้า": "MOBIL MULTIPURPOSE ATF  12/1"
        },
        {
            "รหัสจากโรงงาน": "201-06-0404",
            "ชื่อสินค้า": "MOBIL BRAKE FLUID DOT 4  12/1"
        },
        {
            "รหัสจากโรงงาน": "201-06-0604",
            "ชื่อสินค้า": "MOBIL COOLANT EX RM-24  12/1"
        },
        {
            "รหัสจากโรงงาน": "201-22-0802",
            "ชื่อสินค้า": "MOBIL DTE 26    1/20"
        },
        {
            "รหัสจากโรงงาน": "201-34-0214",
            "ชื่อสินค้า": "MOBILTEMP SHC 100   1/18 KG"
        },
        {
            "รหัสจากโรงงาน": "203-01-0201",
            "ชื่อสินค้า": "สเปรย์แว็กซ์ชายน์ Wax Shine"
        },
        {
            "รหัสจากโรงงาน": "203-01-0302",
            "ชื่อสินค้า": "REMY Calypsol น้ำมันครอบจักรวาล 420ml. 12/1"
        }
    ]
}



data = data.Sheet1

let sql = `

update app_datas.dat_products as t set
    product_name = json_build_object('th',c.product_name,'en',c.product_name)
from (values
    

`

for (let index = 0; index < data.length; index++) {
    const element = data[index];

    sql = sql + `('${element['รหัสจากโรงงาน']}', '${element['ชื่อสินค้า']}'),  
`
}

sql = sql + `
) as c(master_path_code_id, product_name) 
where c.master_path_code_id = t.master_path_code_id;
`

console.log(sql)